In [1]:
import pandas as pd

In [43]:
import numpy as np

In [3]:
authors = pd.DataFrame({'author_id':[1, 2, 3], 'author_name':['Тургенев', 'Чехов', 'Островский']})

In [4]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [5]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3],'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],'price':[450, 300, 350, 500, 450, 370, 290]})

In [6]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [20]:
a=authors.merge(book)

In [21]:
a

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [22]:
top5 = a.nlargest(5,'price').reset_index(drop=True)

In [17]:
top5

   author_id author_name         book_title  price
0          2       Чехов   Толстый и тонкий    500
1          1    Тургенев        Отцы и дети    450
2          2       Чехов    Дама с собачкой    450
3          3  Островский              Гроза    370
4          1    Тургенев  Дворянское гнездо    350

In [23]:
min_pr_au = a.groupby('author_name').agg({'price':'min'})

In [24]:
min_pr_au

             price
author_name
Островский     290
Тургенев       300
Чехов          450

In [26]:
max_pr_au = a.groupby('author_name').agg({'price':'max'})

In [27]:
max_pr_au

             price
author_name
Островский     370
Тургенев       450
Чехов          500

In [28]:
mean_pr_au = a.groupby('author_name').agg({'price':'mean'})

In [29]:
mean_pr_au

                  price
author_name
Островский   330.000000
Тургенев     366.666667
Чехов        475.000000

In [34]:
autors_stat = pd.merge(min_pr_au, max_pr_au, on='author_name', how='inner')

In [35]:
autors_stat

             price_x  price_y
author_name
Островский       290      370
Тургенев         300      450
Чехов            450      500

In [36]:
autors_stat = pd.merge(autors_stat, mean_pr_au, on='author_name', how='inner')

In [37]:
autors_stat

             price_x  price_y       price
author_name
Островский       290      370  330.000000
Тургенев         300      450  366.666667
Чехов            450      500  475.000000

In [39]:
autors_stat = a.groupby('author_name')['price'].agg(['min','max','mean']).reset_index()

In [40]:
autors_stat

  author_name  min  max        mean
0  Островский  290  370  330.000000
1    Тургенев  300  450  366.666667
2       Чехов  450  500  475.000000

In [42]:
a['cover']=['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [45]:
book_info = pd.pivot_table(data = a, values ='price', index = 'author_name', columns ='cover', aggfunc=sum).fillna(0)

In [46]:
book_info

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

In [47]:
book_info.to_pickle('book_info.pkl')

In [48]:
book_info2 = pd.read_pickle('book_info.pkl')

In [49]:
book_info2 == book_info

cover        мягкая  твердая
author_name
Островский     True     True
Тургенев       True     True
Чехов          True     True

значит, идентичны